---
kind: method
id: M:Autodesk.Revit.UI.Plumbing.PipeFittingAndAccessoryPressureDropUIData.GetUnits
source: html/1b626235-f4b5-cb31-28fe-fbe27353979a.htm
---
# Autodesk.Revit.UI.Plumbing.PipeFittingAndAccessoryPressureDropUIData.GetUnits Method

Gets units.

## Syntax (C#)
```csharp
public Units GetUnits()
```

## Returns
The Units object.